{
    
         "title":"10 Cheap and Healthy Sources of Protein",
         "description":"1Protein is a crucial nutrient. While some sources of protein are expensive, there are also many affordable alternatives.",
         "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/proteinfoods.jpg",
         "type":"blog",
         "content":[
             {
                 "name":"Natural peanut butter",
                 "description":"or a plant-based option, peanut butter provides a solid dose of protein. It is also cost-friendly, with an average cost of around $2.50 per 16-ounce (454-gram) jar.A two-tablespoon serving of this creamy nut butter provides 7 grams of protein (3Trusted Source).Aside from being a good source of protein, peanut butter can be used in many ways. Pair it with fruit and oatmeal or add it to your favorite smoothie for a protein boost.What’s more, studies have shown that people who include peanuts and peanut butter in their diets are less likely to develop certain chronic diseases like heart disease and diabetes (4Trusted Source, 5).Choose natural peanut butter when possible to avoid unwanted ingredients like added sugar and added saturated fats."
             },
             {
                 "name":"Eggs",
                 "description":"Eggs are one of the most nutrient-dense foods on the planet, and are very affordable with an average price of $2 to $4 per dozen.Not only are they full of vitamins, minerals and healthy fats, but they are also packed with protein. One large egg contains 6 grams (6Trusted Source).Adding eggs to your diet is a great way to increase your protein intake and may also help you reduce your calorie intake and lose weight.Several studies have shown that having eggs for breakfast helps you eat fewer calories throughout the day by keeping hunger in check. This can, in turn, help you lose weight.For example, one 2008 study found that participants who consumed an egg breakfast for eight weeks lost 65% more weight than those who ate a bagel breakfast "
             },
             {
                 "name":"Edamame",
                 "description":"This tasty, bright green bean is an amazing, low-priced source of plant-based protein.Edamame beans are immature soybeans that are sold both shelled or in the pod. They are a delicious snack and make a great addition to meals like salads and stir-frys.Plus, edamame is an excellent source of protein with one cup of shelled beans (160 grams) providing an impressive 18 grams of protein (9Trusted Source).Edamame is also a great choice for those who follow vegetarian or vegan diets.This is because they are considered a complete protein source, meaning they contain all the essential amino acids that the body requires (10).This budget-friendly bean can be found in the freezer section of most grocery stores for around $2 per 12-ounce (340-gram) bag"
             },
             {
                 "name":"Plain Greek yogurt",
                 "description":"Greek yogurt is a delicious, low-cost food that is extremely versatile. It can be eaten plain, added to a smoothie, whipped into a tasty dip for veggies or added to baked goods.Additionally, yogurt is an excellent source of protein.In fact, an 100-gram serving provides around 9 grams of protein — over double the amount found in regular plain yogurts (14Trusted Source, 15Trusted Source).Look for brands with a “live and active cultures” label, which means that the yogurt contains beneficial probiotics that can improve gut health and even help you lose weight (16Trusted Source).Not to mention, choosing plain, unsweetened Greek yogurt is a great way to keep your intake of added sugar to a minimum.Lastly, buying larger containers is a great way to save money, as 24 ounces (680 grams) of plain Greek yogurt costs about $5."
             },
             {
                 "name":"Sunflower seeds",
                 "description":"Although sunflower seeds are tiny, they contain an impressive amount of protein. A one ounce serving contains about 6 grams of plant-based, vegan-friendly protein (17Trusted Source).These buttery-tasting nutritional powerhouses are a good source of protein, as well as nutrients like vitamin E and magnesium.Sunflower seeds are a versatile and cost-friendly food, too.They can be purchased for around $2 per pound (454 grams) at most stores, and can be added to salads or yogurt parfaits, as well as used as a crunchy topping for many dishes."
             },
             {
                 "name":" Black beans",
                 "description":"Black beans are one of the most convenient and affordable forms of plant-based protein that you can buy. On average, a 15-ounce (455-gram) can costs around $1 in most stores.One half cup (86 grams) of black beans also contains 7.6 grams of protein (18Trusted Source).On top of containing a good amount of protein, black beans are an excellent source of fiber. One half cup (86 grams) contains about 7.5 grams.Top health organizations recommend that women eat 25 grams of fiber per day and that men eat 38 grams per day.Due to the high amounts of protein and fiber that they contain, black beans make you feel full and are excellent for weight loss.In fact, a 2016 review of 21 studies found eating 3/4 of a cup of beans each day led to weight loss of 0.75 pounds (0.34 kg) for people who made no other dietary changes (19Trusted Source).Moreover, diets rich in beans have been shown to reduce hunger and increase fullness (20Trusted Source, 21).They can be added to dishes like chili, soups and salads to provide a powerful punch of plant-based protein."
             },
             {
                 "name":"Cottage cheese",
                 "description":"Cottage cheese is a low-calorie dairy product that is high in protein.This mild-flavored cheese comes in a variety of fat percentages and can be used as a filling snack or as an ingredient in many recipes.One cup (210 grams) of full-fat cottage cheese provides over 23 grams of protein and only 206 calories (24Trusted Source).The high protein content of cottage cheese makes it an excellent choice for athletes and people looking to build muscle mass.Plus, studies have shown that protein-rich foods like cottage cheese help keep you feeling full, which may help you lose weight (25Trusted Source, 26Trusted Source).Cottage cheese is very affordable and can be purchased at most stores for around $3 per 16-ounce (452-gram) tub."
             },
             {
                 "name":"Oats",
                 "description":"Oats are a hearty, gluten-free grain that is very inexpensive. Most stores sell rolled oats in bulk for around $1.30 per pound (453 grams).They also happen to be much higher in protein than other grains. A 100 gram serving provides 13 grams of protein. Keep in mind that the usual serving size of oatmeal is about half a cup or 40 grams, which provides 5 grams of protein (32Trusted Source).Oats are high in vitamins and minerals, plus contain a type of soluble fiber called beta-glucan.Studies have shown that foods rich in beta-glucan may help reduce LDL and total cholesterol levels, making oatmeal a great choice for heart health (33).A bowl of oatmeal is a great way to keep your heart healthy and can be part of a high protein breakfast, if combined with milk, adding nuts or seeds, topping with peanut butter, or mixing in protein powder or liquid egg whites to boost the protein content of an oat based breakfast."
             },
             {
                 "name":"Milk",
                 "description":"Although some people are intolerant of the lactose in milk and other dairy products, it is an affordable source of highly absorbable protein for those able to digest it. For those who have lactose intolerance, there are many lactose free milks available to allow you to benefit from the protein content.Milk comes in many fat percentages and is widely available, making it a convenient protein choice. A half-gallon (115 grams) of conventional milk has an average price of around $2.50, while organic milk costs about $4.One cup (249 grams) of whole milk contains over 8 grams of highly absorbable protein, along with loads of vitamins and minerals (35Trusted Source).It is especially high in the minerals calcium and phosphorus, which help keep bones strong and healthy.Since milk is a liquid, it can be used as a high-protein base for smoothies and soups.Whole milk also makes an excellent high-calorie, protein-rich ingredient for those who are trying to gain weight and muscle mass. Meanwhile, skim milk contains the same amount of protein with about half the calories for those who are trying to lose weight and maintain muscle mass."
             },
             {
                 "name":"Pumpkin seeds",
                 "description":"Pumpkin seeds deliver a massive amount of nutrients in a very small package. Adding these budget-friendly seeds to your diet is a smart and healthy way to increase your protein intake.Just one ounce (28 grams) of pumpkin seeds contains 8 grams of protein, making them an excellent choice for a snack (36Trusted Source).Along with an impressive amount of protein, pumpkin seeds also contain antioxidants like vitamin E and phenolic acids that help reduce inflammation in the body (37Trusted Source, 38Trusted Source, 39Trusted Source).Pumpkin seeds make an excellent snack on the go, though they can also be added to oatmeal, salads or homemade granola. They can be purchased in bulk from most stores for around $3 per pound (448 grams)."
             }
         ]    
     }
    