{
    
    "title":"5 habits that foster weight loss",
    "description":"Let’s face it: the hardest part about losing weight isn’t knowing what to eat. You’ve heard it a thousand times: eat lots of vegetables, fruits, whole grains, and lean protein. The real challenge is changing your habits to make those healthy choices part of your everyday routine without feeling too deprived.",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/weightloss1.jpg",
    "content":[
        {
            "name":"Make time to prepare healthy meals",
            "description":"Home-cooked food tends to be far lower in calories, fat, salt, and sugar than restaurant food and most processed food. But it takes time and effort to choose recipes, go to the store, and cook. Take a close look at your weekly schedule to see if you can carve out a few hours to devote to meal planning and shopping, which is more than half the battle. It could be on Sunday afternoon or in 15- to 30-minute increments throughout the week.To save time in the kitchen, take advantage of pre-cut vegetables and cooked whole grains (like brown rice) from the salad bar or freezer case. And stock up on easy, wholesome snacks like fruit, nuts, and low-fat cheese sticks."
        },
        {
            "name":"Eat slowly. ",
            "description":"The next time you sit down for a meal, set a timer (maybe the one on your kitchen stove or smartphone) for 20 minutes. That’s about how long it takes the “I’m full” message sent by the gut hormones and stretch receptors in your stomach to reach your brain. If you can spend a full 20 minutes between your first bite and your last, you’ll feel satisfied but not stuffed. Eat too quickly and you’re more likely to overeat. Tips for stretching out your mealtime include chewing each bite a little longer than usual, setting down your fork between each bite, and taking frequent sips of water during your meal."
        },
        {
            "name":"Eat evenly sized meals, beginning with breakfast.",
            "description":"Most people tend to eat a small breakfast (or none at all), a medium-sized lunch, and a large dinner. But you may be better off spreading out your calories more evenly throughout the day. For one thing, a small or nonexistent breakfast can leave you ravenous by lunchtime, which may lead you to overeat. A morning meal also helps rev up your metabolism for the day, stimulating enzymes that help you burn fat. What’s more, eating at least 450 calories per meal can help you avoid hunger between meals. If you eat a light supper (and avoid grazing late into the night; see tip 4), you may eat fewer calories overall — and actually be hungry for breakfast."
        },
        {
            "name":"Don’t skimp on sleep.",
            "description":"When you burn the midnight oil, you’re probably not also burning calories, but instead consuming too many. Many studies have linked shorter sleep duration with a higher risk of being overweight or obese. A recent review article suggests why: people who sleep fewer than six hours a night tend to have irregular eating habits — including more frequent, smaller, energy-dense, and highly palatable snacks (read: fatty, sugary foods like chips, cookies, and ice cream)."
        },
        {
            "name":"Weigh yourself often.",
            "description":"If you don’t already have one, get a digital scale. Hang a calendar and pen above it, right at eye level, as a reminder to record your weight every day. Doing so only takes a few seconds and will keep you heading in the right direction. Most people find it difficult or tedious to track their calories, both from the foods they eat and those they burn via exercise. But a daily weigh-in tells you all you need to know — and the scale doesn’t lie. Also, research shows that people who weigh themselves often are more likely to lose weight and keep it off."
        }
    ]    
}
