{
"blogs":[
 {
        "title":"7+ Healthy Smoothie Recipes to Make for Breakfast",
        "description":"Healthy smoothie recipes provide an ideal fix for anyone looking for something nutritious to eat, stat. Throw a few ingredients into a blender, grab a glass, and you’re ready to go in just a few seconds. Easy, right? But not all smoothies will help you meet your nutritional (or weight loss) goals. In fact, many pre-made smoothies (and smoothie bowls) you find at the store are loaded with excess sugar and don't have enough fiber, protein or fat to keep you satiated.Good news: If you’re looking for healthy smoothies for weight loss or just a delicious way to start your day, we have expert-approved tips, tricks, and ingredients to toss into your blender.",
        "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/7+smoothie.jpg",
        "url":"healthysmoothie"
 },
 {
    "title":"High-Fiber Foods to Up Your Daily Fiber Intake",
    "description":" ",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/fibre.jpg",
    "url":"fibrefood"
 },
 {
    "title":"10 Cheap and Healthy Sources of Protein",
    "description":"Protein is a crucial nutrient. While some sources of protein are expensive, there are also many affordable alternatives.",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/proteinfoods.jpg",
    "url":"proteinfoods"
 },
 {
    "title":"6 Yoga Poses to Boost Your Immune System",
    "description":"Inspired by Ayurveda, this yoga sequence for your immune system is designed to keep you healthy during cold and flu season. It contains both heated poses to help clear congestion, and soothing, restorative postures to build ojas, or vigor, which is often considered the protective buffer of your immune system.",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/yoga.jpg",
    "url":"yoga"
 },
 {
    "title":"6 Quick & Easy Overnight Oats Recipes",
    "description":"Overnight oats are simply oats that are left to soak overnight instead of cooked in the morning, which makes them perfect for a quick, filling and nutritious breakfast.",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/overnightoats.jpg",
    "url":"overnighoats"
 },
 {
    "title":"5 habits that foster weight loss",
    "description":"Let’s face it: the hardest part about losing weight isn’t knowing what to eat. You’ve heard it a thousand times: eat lots of vegetables, fruits, whole grains, and lean protein. The real challenge is changing your habits to make those healthy choices part of your everyday routine without feeling too deprived.",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/weightloss1.jpg",
    "url":"weightloss1"
 },
 {
    "title":" 8 Foods to Help Manage Blood Sugar ",
    "description":"If you're living with diabetes, you probably know all about the careful balancing act that is diabetes nutrition. Making good food choices can make a big impact on blood sugar management, but sometimes it’s tricky to know which foods are considered good choices. These 10 picks can help you manage blood sugar levels and keep your numbers in check",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/diabetes1.jpg",
    "url":"diabetes1"
 }
 ,
 {
    "title":"6 Foods To Not Consume With Coffee",
    "description":"Coffee can offer a temporary energy boost and other health benefits, making it a powerful addition to a well-balanced diet. For example, research has proven that moderate coffee consumption can help prevent inflammatory and oxidative stress-related diseases, such as type 2 diabetes and several types of cancer.",
    "image":"https://divyanshu-950.github.io/RecipeAPI/HealthyLifestyle/img/coffee1.jpg",
    "url":"coffee1"
 }
]
}